
    # Вычислить число Пи c заданной точностью d

import math 
pi = str(math. pi)

len_pi = input('Введите точность числа пи в формате 0.001:\n')
print(pi[:len(len_pi)])

